app/views/programs/_form.html.erb

	<% else %>
		<input type="hidden" value= "<%=Organization.find(current_organization_account.organization_id).name%>" name="program[organization_name]" disabled="disabled">
---
SELECT COUNT(*) FROM "organizations" WHERE "organizations"."name" = ''


$(document).ready(function(){


	//create the array that keeps track of the "# weeks" that have already been used
	numWeeksAlreadyUsed = [];

	//create the initial input for the user
	createInput();

	//set the organization name if necessary and applicable
	<% if user_signed_in? && current_user.admin? %>
		<% if !@program.organization_id.nil? %>
			$("#tags").val("<%=Organization.find(@program.organization_id).name%>");
		<% end %>
	<% end %>

	//when "+ add cost/length" is clicked, create 2 new input fields:
		//one for the new length of time, one for the new total cost
	$(".createInput").click(function(event) {
		event.preventDefault();
		if (document.getElementById("cost"+(countFields - 1)).value != "") { //if the cost field is not blank
---
SELECT "organizations".* FROM "organizations"