app/views/users/index.html.erb

		<p class="copyEmailsTitle">Copy Emails Below</p>
		<% @user_emails = User.where(:notify => true).map(&:email)%>
---
SELECT "users".* FROM "users" WHERE "users"."notify" = 't'