app/views/users/profile.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
				<div class="three columns" id="userImageContainer">
					<% if !(User.find(current_user.id).square_image.url.nil?)%>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 1
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = 1
---
	<div align="right" id="reviewsContainer">
		<%= pluralize(@reviews.count, "Review")%>

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."user_id" = 1
---

            $('#favorites').smartpaginator({ totalrecords: <%=@favorites.count%>, recordsperpage: 4, datacontainer: 'divfavorites', dataelement: 'div', initval: 0, next: 'Next', prev: 'Prev', first: 'First', last: 'Last', theme: 'black' });

UPDATE "users" SET "unread_messages" = 0, "updated_at" = '2012-11-03 22:00:38.736652' WHERE "users"."id" = 1
---
	<% @user.unread_messages = 0 %>
	<% @user.save %>