app/views/users/show.html.erb

UPDATE "users" SET "messages_show" = 'f', "updated_at" = '2012-11-18 21:14:10.670203' WHERE "users"."id" = 1
---
<% @user.messages_show = true%>
<% @user.save%>

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = 1
---

        $(document).ready(function () {

			if (<%= (@user.profile_show).to_s %> == false)
			{
				$("#ageCountryBox").hide();
			}
			if (<%= (@user.messages_show).to_s %> == false)
			{
				$("#messagesBox").hide();
			}


			$('#black').smartpaginator({ totalrecords: <%=@user.reviews.count%>, recordsperpage: 1, datacontainer: 'divs', dataelement: 'div', initval: 0, next: 'Next', prev: 'Prev', first: 'First', last: 'Last', theme: 'black' });


		});