app/views/pages/home.html.erb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."show" = 't'
SELECT COUNT(*) FROM "organizations"
---
<div class="six columns">
<h1><a href="/organizations/show_all" class="bannerLink"><%=Organization.count%>&nbsp;&nbsp; Organizations&nbsp;&nbsp; So &nbsp;&nbsp;Far</a></h1>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."show" = 't'
SELECT COUNT(*) FROM "reviews"
---
<div class="six columns">
<h1 class="voicesHeardHeader"><a href="/reviews/show_all" class="bannerLink"><%= Review.count%>&nbsp;&nbsp; Voices &nbsp;&nbsp;Heard</a></h1>

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
	<div class="usernameBy row">
		<h3 class="thin left"><span style="font-size:0.8em">by: </span><a href="/users/<%=f.user_id%>" class="blue-link">"<%= User.find(f.user_id).username%>"</a>