app/views/feedbacks/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
	<% else %>
	<%= link_to User.find(f.user_id).username, User.find(f.user_id)%>