app/views/searches/search_machine.html.erb

SELECT "programs".* FROM "programs"
---
    <% @locations = [] %>
    <% Program.all.each do |f| %>