app/controllers/blog_posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."is_our_blog" = 'f'
---
  def resources
    ## Two types of blog posts, interesting (articles) and our_blog (staff written)
    @interesting = BlogPost.where(:is_our_blog => false).sort_by{|e| e[:published_at]}.reverse