app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("body", "contact_email", "country", "created_at", "email", "has_profile", "is_request", "main_contact", "name", "organization_account_id", "organization_name", "organization_url", "position_of_contact", "subject", "to_whom", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contact = Contact.new(params[:contact])
    @contact.body = RedCloth.new( ActionController::Base.helpers.sanitize( @contact.body ), [:filter_html, :filter_styles, :filter_classes, :filter_ids] ).to_html unless @contact.body.nil?

  respond_to do |format|
    if @contact.to_whom == "request"
      @contact.is_request = true
      if @contact.save(:validate => false)