app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks"
---
  def index
    if (user_signed_in? && current_user.admin?)
    @feedbacks = Feedback.all.reverse

INSERT INTO "feedbacks" ("admin_read", "body", "created_at", "email", "show", "truncated100", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @feedback = Feedback.new(params[:feedback])
    @feedback.truncated100 = @feedback.body[0..199] + "..."
    respond_to do |format|
      if @feedback.save