app/controllers/organizations_controller.rb

  def create
    @organization = Organization.new(params[:organization])
    @organization.description = RedCloth.new(@organization.description).to_html
    @organization.application_process = RedCloth.new(@organization.application_process).to_html
    @organization.business_model = RedCloth.new(@organization.business_model).to_html
    @organization.program_model = RedCloth.new(@organization.program_model).to_html
    @organization.good_to_know = RedCloth.new(@organization.good_to_know).to_html
    @organization.training_resources = RedCloth.new(@organization.training_resources).to_html
    @organization.program_costs_breakdown = RedCloth.new(@organization.program_costs_breakdown).to_html
    @organization.run_by = RedCloth.new(@organization.run_by).to_html
    @organization.price_ranges = RedCloth.new(@organization.price_ranges).to_html
    @organization.reviews_count = 0
    @organization.overall = 0
    @organization.index!

    if user_signed_in? && current_user.admin?
      if @organization.save
---
INSERT INTO "organizations" ("additional_fees", "application_process", "business_model", "created_at", "crop_h", "crop_w", "crop_x", "crop_y", "crops", "description", "email", "full_time_staff", "good_to_know", "headquarters_location", "id_number", "image", "invite_email", "misson", "name", "num_reviews", "num_vols_date", "num_vols_yr", "operating_since", "overall", "page_views", "phone", "price_breakdown", "price_ranges", "program_costs_doesnt_include", "program_costs_includes", "program_id", "program_model_string", "published_docs", "reviewed_at", "reviews_count", "run_by", "show", "square_image", "training_resources", "truncated75", "types_of_programs", "updated_at", "url", "volunteer_program_model", "will_invite") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)