app/controllers/pages_controller.rb

  def home
    @feedbacks = Feedback.where(:show => true)
    @reviews = Review.where(:show => true)
    @organizations = Organization.where(:show => true)
---
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."show" = 't'
SELECT "reviews".* FROM "reviews" WHERE "reviews"."show" = 't'
SELECT "organizations".* FROM "organizations" WHERE "organizations"."show" = 't'

    def program_browse
      @organic_farming = ProgramSubject.where(:subject => "Organic Farming")
---
SELECT "program_subjects".* FROM "program_subjects" WHERE "program_subjects"."subject" = 'Agriculture'