app/controllers/programs_controller.rb

  def show
    @program = Program.find(params[:id])
---
SELECT "programs".* FROM "programs" WHERE "programs"."id" = ? LIMIT 1  [["id", "100"]]

  def create
    @program = Program.new(params[:program])
    @program.organization_id = Organization.where(:name => @program.organization_name).first.id
    @program.truncated_description100 = RedCloth.new( ActionController::Base.helpers.sanitize( @program.description[0,99] + "..."), [:filter_html, :filter_styles, :filter_classes, :filter_ids] ).to_html
    @program.description = RedCloth.new( ActionController::Base.helpers.sanitize( @program.description ), [:filter_html, :filter_styles, :filter_classes, :filter_ids] ).to_html
    @program.program_structure = RedCloth.new( ActionController::Base.helpers.sanitize( @program.program_structure ), [:filter_html, :filter_styles, :filter_classes, :filter_ids] ).to_html
    @program.program_cost_breakdown = RedCloth.new( ActionController::Base.helpers.sanitize( @program.program_cost_breakdown ), [:filter_html, :filter_styles, :filter_classes, :filter_ids] ).to_html
    @program.cost_includes = RedCloth.new( ActionController::Base.helpers.sanitize( @program.cost_includes ), [:filter_html, :filter_styles, :filter_classes, :filter_ids] ).to_html
    @program.cost_doesnt_include = RedCloth.new( ActionController::Base.helpers.sanitize( @program.cost_doesnt_include ), [:filter_html, :filter_styles, :filter_classes, :filter_ids] ).to_html

    @lengths = []
    @program.program_lengths.split(",").each do |f|
---
SELECT "organizations".* FROM "organizations"
SELECT COUNT(*) FROM "organizations" WHERE "organizations"."name" = ''