app/controllers/reviews_controller.rb

SELECT "programs".* FROM "programs"
---
     def new
       @review = Review.new
       if user_signed_in?
       @review.organization_id = params[:organization_id]
       @review.program_id = params[:program_id]

        orgs_array = Organization.all.map { |org| org.name.to_s }

        @progs = []
        @orgNames = []
        @progNames = []
        Program.all.each do |f|