app/controllers/searches_controller.rb

  def show
    if Search.exists?(params[:id])
      @search = Search.find(params[:id])
---
SELECT "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", "1"]]

      @search_sizes = sizes


      @the_search = Program.search do
---
SELECT "programs".* FROM "programs"

  def search_machine
    @search = Search.new
    @locations = []
    Program.all.each do |f|
---
SELECT "programs".* FROM "programs"

  def places
    @programs = Program.all
    @countries_with_programs = []
    @programs.each do |f|
      @countries_with_programs << f.location unless @countries_with_programs.include?(f.location)
    end

    @nums = Array.new
    @progNums = Array.new
    @countries_with_programs.each do |f|
      @progNums << Program.where(:location => f).count unless f == ""
---
SELECT "programs".* FROM "programs"
SELECT COUNT(*) FROM "programs" WHERE "programs"."location" = 'BM'

  def program_browse
    @organic_farming = ProgramSubject.where(:subject => "Organic Farming")
---
SELECT "program_subjects".* FROM "program_subjects" WHERE "program_subjects"."subject" = 'Agriculture'

  def create

    @search = Search.new(params[:search])
    if !(params[:subject].nil?)
      @search.subjects = [] << SUBJECTSHASH[params[:subject]]
---
INSERT INTO "searches" ("created_at", "keywords", "length_max_number", "length_max_param", "length_min_number", "length_min_param", "price_max", "price_min", "regions", "sent_from", "showing", "sizes", "sort_by", "subjects", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)