app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index


    if user_signed_in? && current_user.admin?
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."recipient_id" = 1 AND "messages"."recipient_deleted" = 'f'
SELECT "messages".* FROM "messages" WHERE "messages"."sender_id" = 1 AND "messages"."sender_deleted" IS NULL
---
  	def profile
  	  if (user_signed_in?)
  	    @user = User.find(current_user.id)
  	    @reviews = @user.reviews.order("created_at DESC")
  	    @favorites = @user.favorites
  	    @messages = ::Message.where(:recipient_id => current_user.id, :recipient_deleted => false).sort_by(&:created_at).reverse
  	    @sent_messages = ::Message.where(:sender_id => current_user.id, :sender_deleted => nil).sort_by(&:created_at).reverse