app/views/reviews/_form.html.erb

<% progNames = []%>
<% Program.all.each do |f|%>
---
SELECT "programs".* FROM "programs"